In [1]:
# insert libraries
import pandas as pd 
import sqlite3
import matplotlib.pyplot as plt  
import numpy as np 
import os
import pymysql
import sqlalchemy
import ssl
from sqlalchemy import create_engine, text
import warnings  
warnings.filterwarnings("ignore")

In [2]:
#load data
movies = pd.read_csv('/Users/niyatkahsay/Desktop/ADS_507/group_project/ml-25m/movies.csv')
ratings = pd.read_csv('/Users/niyatkahsay/Desktop/ADS_507/group_project/ml-25m/ratings.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [3]:
#change data type
movies['release_year'] = pd.to_numeric(movies['title'].str.extract(r'\((\d{4})\)')[0], errors='coerce').fillna(0).astype(int)
movies['title'] = movies['title'].str.replace(r'\(\d{4}\)', '', regex=True).str.strip()

In [4]:
ratings.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [5]:
print(movies.columns)
print(ratings.columns)

Index(['movieId', 'title', 'genres', 'release_year'], dtype='object')
Index(['userId', 'movieId', 'rating', 'timestamp'], dtype='object')

In [6]:
#merge dataset
merged_df = pd.merge(movies, ratings, on='movieId', how='inner')
merged_df.head()

,movieId,title,genres,release_year,userId,rating,timestamp
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,2,3.5,1141415820
1,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,3,4.0,1439472215
2,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,4,3.0,1573944252
3,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,5,4.0,858625949
4,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,8,4.0,890492517

In [7]:
# save the DataFrame to a CSV file
merged_df.to_csv('merged_movies_ratings.csv', index=False)

# load the CSV into a DataFrame
merged_table = pd.read_csv('merged_movies_ratings.csv')

In [8]:


# database connection string
DATABASE = "mysql+pymysql://root:school@localhost:3306/movies"
engine = create_engine(DATABASE)

# query to select the 'movies' database
try:
    with engine.connect() as connection:
        # Use the 'movies' database
        connection.execute(text("USE movies;"))
        print("Switched to 'movies' database.")
except Exception as e:
    print(f"Error: {e}")

Switched to 'movies' database.

In [9]:
# upload to MySQL
merged_table.to_sql('merged_table', con=engine, if_exists='replace', index=False)
print("merged_table uploaded to MySQL successfully!")

merged_table uploaded to MySQL successfully!

In [10]:
# upload to MySQL under the correct database
merged_table.to_sql('merged_table', con=engine, schema='movies', if_exists='replace', index=False)  
print("merged_table uploaded to MySQL successfully!")

merged_table uploaded to MySQL successfully!

In [11]:
merged_df.head()

,movieId,title,genres,release_year,userId,rating,timestamp
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,2,3.5,1141415820
1,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,3,4.0,1439472215
2,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,4,3.0,1573944252
3,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,5,4.0,858625949
4,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,8,4.0,890492517

i know it is too much work, but i could not combime our datasets so i downloaded new, that has movies and ratings, which are enough to create a database "https://grouplens.org/datasets/movielens/25m/"

In [14]:

#create a function to execute sql query
def execute_query(query):
    with engine.connect() as connection:
        result = connection.execute(text(query))
        return result.fetchall()

In [15]:
# create tables and handle the merged_table
queries = [
    """
    DROP DATABASE IF EXISTS movies;
    CREATE DATABASE movies;
    """,
    """
    USE movies;

    CREATE TABLE Movies (
        movie_id INT PRIMARY KEY,
        title VARCHAR(255) NOT NULL,
        release_year INT
    );

    CREATE TABLE Genres (
        genre_id INT AUTO_INCREMENT PRIMARY KEY,
        genre_name VARCHAR(50) UNIQUE NOT NULL
    );

    CREATE TABLE MovieGenres (
        movie_id INT,
        genre_id INT,
        PRIMARY KEY (movie_id, genre_id),
        FOREIGN KEY (movie_id) REFERENCES Movies(movie_id) ON DELETE CASCADE,
        FOREIGN KEY (genre_id) REFERENCES Genres(genre_id) ON DELETE CASCADE
    );

    CREATE TABLE Users (
        user_id INT PRIMARY KEY
    );

    CREATE TABLE Ratings (
        user_id INT,
        movie_id INT,
        rating DECIMAL(3,1),
        timestamp BIGINT,
        PRIMARY KEY (user_id, movie_id),
        FOREIGN KEY (user_id) REFERENCES Users(user_id),
        FOREIGN KEY (movie_id) REFERENCES Movies(movie_id)
    );

    CREATE TABLE merged_table (
        movieId BIGINT,
        title TEXT,
        genres TEXT,
        release_year BIGINT,
        userId BIGINT,
        rating DOUBLE,
        timestamp BIGINT
    );
    """
]

# execute the queries to create the database and tables
execute_queries(queries)
print("Database and tables created successfully!")

# insert data from merged_table to Movies table
insert_movies_query = """
INSERT IGNORE INTO Movies (movie_id, title, release_year)
SELECT DISTINCT movieId AS movie_id, title, release_year
FROM merged_table;
"""
execute_queries([insert_movies_query])
print("Movies data inserted successfully!")

NameError: name 'execute_queries' is not defined

In [ ]:
#load data into the schema
insert_queries = [
    # insert into Movies
    """
    INSERT IGNORE INTO Movies (movie_id, title, release_year)
    SELECT DISTINCT movieId AS movie_id, title, release_year
    FROM merged_table;
    """,

    # insert unique genres
    """
    INSERT IGNORE INTO Genres (genre_name)
    SELECT DISTINCT TRIM(genre) AS genre_name
    FROM (
        SELECT SUBSTRING_INDEX(SUBSTRING_INDEX(genres, '|', n.n), '|', -1) AS genre
        FROM merged_table
        JOIN (
            SELECT 1 AS n UNION ALL SELECT 2 UNION ALL SELECT 3 UNION ALL SELECT 4 UNION ALL SELECT 5
            UNION ALL SELECT 6 UNION ALL SELECT 7 UNION ALL SELECT 8 UNION ALL SELECT 9 UNION ALL SELECT 10
        ) n
        WHERE n.n <= 1 + LENGTH(genres) - LENGTH(REPLACE(genres, '|', ''))
    ) AS genre_list
    WHERE genre IS NOT NULL AND genre <> '';
    """,

    # insert into Users
    """
    INSERT IGNORE INTO Users (user_id)
    SELECT DISTINCT userId AS user_id
    FROM merged_table;
    """,

    # insert into MovieGenres
    """
    INSERT IGNORE INTO MovieGenres (movie_id, genre_id)
    SELECT DISTINCT mt.movieId AS movie_id, g.genre_id
    FROM merged_table mt
    JOIN Genres g 
      ON FIND_IN_SET(g.genre_name, REPLACE(mt.genres, '|', ',')) > 0;
    """,

    # insert into Ratings
    """
    TRUNCATE TABLE Ratings;

    INSERT INTO Ratings (user_id, movie_id, rating, timestamp)
    SELECT 
        CAST(userId AS SIGNED) AS user_id,
        CAST(movieId AS SIGNED) AS movie_id,
        NULLIF(rating, 0) AS rating,
        IF(timestamp > 0, timestamp, NULL) AS rating_timestamp
    FROM merged_table
    WHERE CAST(userId AS SIGNED) IN (SELECT user_id FROM Users)
      AND CAST(movieId AS SIGNED) IN (SELECT movie_id FROM Movies)
      AND rating BETWEEN 0.5 AND 5.0;
    """
]

# execute the queries
execute_queries(insert_queries)
print("Dataset inserted successfully!")

Dataset inserted successfully!

In [34]:
# views creation queries
view_queries = [
    """
    CREATE OR REPLACE VIEW View_AverageRatings AS
    SELECT 
        m.movie_id, 
        m.title, 
        ROUND(AVG(r.rating), 2) AS avg_rating,
        COUNT(r.rating) AS num_ratings
    FROM Movies m
    JOIN Ratings r ON m.movie_id = r.movie_id
    GROUP BY m.movie_id, m.title
    ORDER BY avg_rating DESC;
    """,

    """
    CREATE OR REPLACE VIEW View_UserRatings AS
    SELECT 
        u.user_id, 
        m.movie_id, 
        m.title, 
        r.rating, 
        FROM_UNIXTIME(r.timestamp) AS rating_date
    FROM Users u
    JOIN Ratings r ON u.user_id = r.user_id
    JOIN Movies m ON m.movie_id = r.movie_id;
    """,

    """
    CREATE OR REPLACE VIEW View_TopRatedMovies AS
    SELECT 
        var.movie_id, 
        var.title, 
        var.avg_rating, 
        var.num_ratings
    FROM View_AverageRatings var
    WHERE var.num_ratings >= 50 -- Filter for movies with at least 50 ratings
    ORDER BY var.avg_rating DESC
    LIMIT 10;
    """,

    """
    CREATE OR REPLACE VIEW View_MovieGenres AS
    SELECT 
        m.movie_id, 
        m.title, 
        g.genre_name
    FROM Movies m
    JOIN MovieGenres mg ON m.movie_id = mg.movie_id
    JOIN Genres g ON mg.genre_id = g.genre_id;
    """
]

# function to execute view creation
def execute_views(view_list):
    with engine.connect() as connection:
        for query in view_list:
            connection.execute(text(query))
        connection.commit()

# execute the view creation
execute_views(view_queries)
print("Views created successfully!")

Views created successfully!

In [35]:
def execute_query(query):
    with engine.connect() as connection:
        # Execute the query
        result = connection.execute(text(query))
        # For non-SELECT queries (like CREATE VIEW), we don't fetch rows
        if result.returns_rows:
            return result.fetchall()  # Only for queries that return data
        else:
            return None  # For queries like CREATE, INSERT, etc.

In [38]:
from surprise import Dataset, Reader, SVD
from surprise.model_selection import train_test_split
import joblib
import os
import pandas as pd


# Load ratings data and validate
valid_ratings = ratings[
    (ratings['userId'].notna()) &
    (ratings['movieId'].notna()) &
    (ratings['rating'].between(0, 5))
]

# Prepare the Surprise dataset
reader = Reader(rating_scale=(0, 5))
data = Dataset.load_from_df(
    valid_ratings[['userId', 'movieId', 'rating']].rename(columns={'userId': 'user_id', 'movieId': 'item_id'}),
    reader
)

# Train-test split without stratification (simple split)
trainset, testset = train_test_split(
    data, 
    test_size=0.2,
    random_state=42
)

# Train the SVD model
model = SVD(
    n_factors=100,
    n_epochs=20,
    lr_all=0.005,
    reg_all=0.02,
    random_state=42
)
model.fit(trainset)

# Save the model
model_path = 'models/svd_recommender.pkl'
os.makedirs(os.path.dirname(model_path), exist_ok=True)
joblib.dump(model, model_path)
print(f"✅ Model saved to {model_path}")

# Example prediction
try:
    pred = model.predict(uid=2, iid=1)
    print(f"Predicted rating for User 2 and Movie 1: {pred.est:.2f}")
except Exception as e:
    print(f" Prediction failed: {e}")

# Evaluate the model on the test set
from surprise import accuracy
predictions = model.test(testset)

# Calculate RMSE and MAE
rmse = accuracy.rmse(predictions)
print(f"RMSE: {rmse:.4f}")

mae = accuracy.mae(predictions)
print(f"MAE: {mae:.4f}")

# Making predictions for multiple users
def get_predictions_for_user(user_id, model, top_n=10):
    # Get all movies
    all_movie_ids = valid_ratings['movieId'].unique()
    
    # Predict ratings for all movies the user hasn't rated
    predictions = []
    for movie_id in all_movie_ids:
        pred = model.predict(uid=user_id, iid=movie_id)
        predictions.append((movie_id, pred.est))
    
    # Sort by predicted rating (highest first)
    predictions.sort(key=lambda x: x[1], reverse=True)
    
    # Get top N recommendations
    top_recommendations = predictions[:top_n]
    
    # Merge with movie titles and genres
    recommendations = []
    for movie_id, rating in top_recommendations:
        title = movies[movies['movieId'] == movie_id]['title'].values[0]
        genres = movie_genres[movie_genres['movieId'] == movie_id]['genre'].tolist()
        recommendations.append({
            'user_id': user_id,
            'movie_id': movie_id,
            'title': title,
            'predicted_rating': rating,
            'genres': ', '.join(genres)
        })
    
    return recommendations

def save_recommendations_to_csv_optimized(user_id, model, top_n=50000, output_path='top_50000_recommendations.csv'):
    try:
        inner_user_id = model.trainset.to_inner_uid(str(user_id))
    except ValueError:
        print(f"User {user_id} not in trainset.")
        return

    # Get all items in the trainset
    trainset_items = [model.trainset.to_raw_iid(i) for i in range(model.trainset.n_items)]
    rated_movies = valid_ratings[valid_ratings['userId'] == user_id]['movieId'].astype(str).tolist()
    unrated_movies = [mid for mid in trainset_items if mid not in rated_movies]

    # Convert movie IDs to inner IDs
    inner_item_ids = [model.trainset.to_inner_iid(mid) for mid in unrated_movies]

    # Vectorized computation
    user_bias = model.bu[inner_user_id]
    user_factors = model.pu[inner_user_id]
    item_biases = model.bi[inner_item_ids]
    item_factors = model.qi[inner_item_ids]
    global_mean = model.trainset.global_mean

    # Compute predictions
    dot_products = np.dot(item_factors, user_factors)
    predictions = global_mean + user_bias + item_biases + dot_products

    # Combine with movie IDs
    movie_predictions = list(zip(unrated_movies, predictions))
    top_recommendations = sorted(movie_predictions, key=lambda x: x[1], reverse=True)[:top_n]

    # Batch merge with movie info
    recommendations_df = pd.DataFrame(top_recommendations, columns=['movie_id', 'predicted_rating'])
    recommendations_df['movie_id'] = recommendations_df['movie_id'].astype(int)  # Ensure type matches

    # Merge with precomputed movie info (create this outside the function)
    recommendations_df = recommendations_df.merge(movie_info, on='movie_id', how='left')

    # Save to CSV
    recommendations_df.to_csv(output_path, index=False)
    print(f"✅ Top {top_n} recommendations saved to {output_path}")

✅ Model saved to models/svd_recommender.pkl
Predicted rating for User 2 and Movie 1: 3.88
RMSE: 0.7774
RMSE: 0.7774
MAE:  0.5867
MAE: 0.5867

In [39]:
recomendations= pd.read_csv('/Users/niyatkahsay/Desktop/ADS_507/group_project/top_10000_recommendations.csv')
recomendations.head()
recomendations.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   movieId           10000 non-null  int64
 1   predicted_rating  10000 non-null  float64
dtypes: float64(1), int64(1)
memory usage: 156.4 KB